app/controllers/bulk_mailers_controller.rb

  def index
    @bulk_mailers = BulkMailer.all
---
SELECT "bulk_mailers".* FROM "bulk_mailers"

  def create
    @bulk_mailer = BulkMailer.new(bulk_mailer_params)

    respond_to do |format|
      if @bulk_mailer.save
---
INSERT INTO "bulk_mailers" ("to", "cc", "subject", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @bulk_mailer.update(bulk_mailer_params)
---
UPDATE "bulk_mailers" SET "updated_at" = ? WHERE "bulk_mailers"."id" = ?  [["updated_at", "2024-02-19 10:36:14.902550"], ["id", 1]]

    def set_bulk_mailer
      @bulk_mailer = BulkMailer.find(params[:id])
---
SELECT "bulk_mailers".* FROM "bulk_mailers" WHERE "bulk_mailers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]